ab_logs/01-simple_responses/grape_webrick_jbuilder_oj_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        localhost
Server Port:            9292

Document Path:          /random
Document Length:        25 bytes

Concurrency Level:      6
Time taken for tests:   1.932 seconds
Complete requests:      1000
Failed requests:        297
   (Connect: 0, Receive: 0, Length: 297, Exceptions: 0)
Total transferred:      199674 bytes
HTML transferred:       24674 bytes
Requests per second:    517.64 [#/sec] (mean)
Time per request:       11.591 [ms] (mean)
Time per request:       1.932 [ms] (mean, across all concurrent requests)
Transfer rate:          100.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     4   11   3.8     11      27
Waiting:        2   10   3.3      9      21
Total:          4   12   3.8     11      27

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     14
  80%     15
  90%     17
  95%     18
  98%     20
  99%     21
 100%     27 (longest request)