ab_logs/01-simple_responses/kemal_ab_n1kc6_random.log
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /random
Document Length:        25 bytes

Concurrency Level:      6
Time taken for tests:   0.144 seconds
Complete requests:      1000
Failed requests:        254
   (Connect: 0, Receive: 0, Length: 254, Exceptions: 0)
Total transferred:      116728 bytes
HTML transferred:       24728 bytes
Requests per second:    6964.32 [#/sec] (mean)
Time per request:       0.862 [ms] (mean)
Time per request:       0.144 [ms] (mean, across all concurrent requests)
Transfer rate:          793.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   0.4      1       4
Waiting:        0    1   0.4      1       4
Total:          0    1   0.4      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      3
  99%      3
 100%      4 (longest request)